# Tidy Data

- tabular data
- one value per cell
- 1 var / column
- 1 obs / row

In [1]:
import pandas as pd

## One Variable in Multiple Columns

- `melt`

In [5]:
df = pd.read_csv('./untidy_data/treatments.csv')
df

                 treatmenta  treatmentb  treatmentc
0    John Smith         NaN           2           0
1      Jane Doe        16.0          11           3
2  Mary Johnson         3.0           1           4

## One Column With Multiple Variables

- `set_index` + `unstack`
- `pivot_table`

In [8]:
df = pd.read_csv('./untidy_data/students.csv')
df.head()

         date                 var          val
0  2019-02-04   n_late_from_break     4.028120
1  2019-02-04  coffee_consumption  5255.409740
2  2019-02-04      classroom_temp    67.000000
3  2019-02-05   n_late_from_break     2.101998
4  2019-02-05  coffee_consumption  8603.704719

## More complex example

In [21]:
df = pd.read_csv('./untidy_data/sales.csv')
df

  Product  2016 Sales  2016 PPU  2017 Sales  2017 PPU  2018 Sales  2018 PPU
0       A         673         5         231         7         173         9
1       B         259         3         748         5         186         8
2       C         644         3         863         5         632         5
3       D         508         9         356        11         347        14